<!-- dflook/terraform-github-actions {"workspace":"default","backend":"1c305f5bcdfb161de34930cbc22e0d60b15e8ae13fdeb70dbfe4f933d2945e95","backend_type":"artifactory"} -->
Terraform plan in __terraform/keycloak__
<details>
<summary>Plan: 191 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.keycloak_dev.module.azureidir.data.keycloak_authentication_execution.browser_identity_provider_redirector will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_authentication_execution" "browser_identity_provider_redirector" {
      + id                = (known after apply)
      + parent_flow_alias = "browser"
      + provider_id       = "****************************"
      + realm_id          = (known after apply)
    }

  # module.keycloak_dev.module.azureidir.keycloak_authentication_execution_config.browser_identity_provider_redirector_config will be created
  + resource "keycloak_authentication_execution_config" "browser_identity_provider_redirector_config" {
      + alias        = "azureidir"
      + config       = {
          + "defaultProvider" = "azureidir"
        }
      + execution_id = (known after apply)
      + id           = (known after apply)
      + realm_id     = (known after apply)
    }

  # module.keycloak_dev.module.azureidir.keycloak_custom_identity_provider_mapper.azureidir_displayname will be created
  + resource "keycloak_custom_identity_provider_mapper" "azureidir_displayname" {
      + extra_config             = {
          + "claim"          = "name"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "display_name"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "azureidir"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "display_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.azureidir.keycloak_custom_identity_provider_mapper.azureidir_email will be created
  + resource "keycloak_custom_identity_provider_mapper" "azureidir_email" {
      + extra_config             = {
          + "claim"          = "email"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "email"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "azureidir"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "email"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.azureidir.keycloak_custom_identity_provider_mapper.azureidir_firstname will be created
  + resource "keycloak_custom_identity_provider_mapper" "azureidir_firstname" {
      + extra_config             = {
          + "claim"          = "given_name"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "firstName"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "azureidir"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "first_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.azureidir.keycloak_custom_identity_provider_mapper.azureidir_idir_user_guid will be created
  + resource "keycloak_custom_identity_provider_mapper" "azureidir_idir_user_guid" {
      + extra_config             = {
          + "claim"          = "bcgovGUID"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "idir_user_guid"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "azureidir"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "idir_user_guid"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.azureidir.keycloak_custom_identity_provider_mapper.azureidir_idir_username will be created
  + resource "keycloak_custom_identity_provider_mapper" "azureidir_idir_username" {
      + extra_config             = {
          + "claim"          = "samaccountname"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "idir_username"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "azureidir"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "idir_username"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.azureidir.keycloak_custom_identity_provider_mapper.azureidir_lastname will be created
  + resource "keycloak_custom_identity_provider_mapper" "azureidir_lastname" {
      + extra_config             = {
          + "claim"          = "family_name"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "lastName"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "azureidir"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "last_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.azureidir.keycloak_openid_client_scope.idp_scope will be created
  + resource "keycloak_openid_client_scope" "idp_scope" {
      + description            = "azureidir idp client scope"
      + id                     = (known after apply)
      + include_in_token_scope = false
      + name                   = "azureidir"
      + realm_id               = (known after apply)
    }

  # module.keycloak_dev.module.bceidbasic.data.keycloak_authentication_execution.browser_identity_provider_redirector will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_authentication_execution" "browser_identity_provider_redirector" {
      + id                = (known after apply)
      + parent_flow_alias = "browser"
      + provider_id       = "****************************"
      + realm_id          = (known after apply)
    }

  # module.keycloak_dev.module.bceidbasic.keycloak_authentication_execution_config.browser_identity_provider_redirector_config will be created
  + resource "keycloak_authentication_execution_config" "browser_identity_provider_redirector_config" {
      + alias        = "bceidbasic"
      + config       = {
          + "defaultProvider" = "bceidbasic"
        }
      + execution_id = (known after apply)
      + id           = (known after apply)
      + realm_id     = (known after apply)
    }

  # module.keycloak_dev.module.bceidbasic.keycloak_custom_identity_provider_mapper.bceidbasic_bceid_user_guid will be created
  + resource "keycloak_custom_identity_provider_mapper" "bceidbasic_bceid_user_guid" {
      + extra_config             = {
          + "attribute.name" = "useridentifier"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_user_guid"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidbasic"
      + identity_provider_mapper = "saml-user-attribute-idp-mapper"
      + name                     = "bceid_user_guid"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.bceidbasic.keycloak_custom_identity_provider_mapper.bceidbasic_bceid_username will be created
  + resource "keycloak_custom_identity_provider_mapper" "bceidbasic_bceid_username" {
      + extra_config             = {
          + "attribute.name" = "username"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_username"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidbasic"
      + identity_provider_mapper = "saml-user-attribute-idp-mapper"
      + name                     = "bceid_username"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.bceidbasic.keycloak_custom_identity_provider_mapper.bceidbasic_displayname will be created
  + resource "keycloak_custom_identity_provider_mapper" "bceidbasic_displayname" {
      + extra_config             = {
          + "attribute.name" = "displayName"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "display_name"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidbasic"
      + identity_provider_mapper = "saml-user-attribute-idp-mapper"
      + name                     = "display_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.bceidbasic.keycloak_custom_identity_provider_mapper.bceidbasic_email will be created
  + resource "keycloak_custom_identity_provider_mapper" "bceidbasic_email" {
      + extra_config             = {
          + "attribute.name" = "email"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "email"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidbasic"
      + identity_provider_mapper = "saml-user-attribute-idp-mapper"
      + name                     = "email"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.bceidbasic.keycloak_openid_client_scope.idp_scope will be created
  + resource "keycloak_openid_client_scope" "idp_scope" {
      + description            = "bceidbasic idp client scope"
      + id                     = (known after apply)
      + include_in_token_scope = false
      + name                   = "bceidbasic"
      + realm_id               = (known after apply)
    }

  # module.keycloak_dev.module.bceidboth.data.keycloak_authentication_execution.browser_identity_provider_redirector will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_authentication_execution" "browser_identity_provider_redirector" {
      + id                = (known after apply)
      + parent_flow_alias = "browser"
      + provider_id       = "****************************"
      + realm_id          = (known after apply)
    }

  # module.keycloak_dev.module.bceidboth.keycloak_authentication_execution_config.browser_identity_provider_redirector_config will be created
  + resource "keycloak_authentication_execution_config" "browser_identity_provider_redirector_config" {
      + alias        = "bceidboth"
      + config       = {
          + "defaultProvider" = "bceidboth"
        }
      + execution_id = (known after apply)
      + id           = (known after apply)
      + realm_id     = (known after apply)
    }

  # module.keycloak_dev.module.bceidboth.keycloak_custom_identity_provider_mapper.bceidboth_bceid_business_guid will be created
  + resource "keycloak_custom_identity_provider_mapper" "bceidboth_bceid_business_guid" {
      + extra_config             = {
          + "attribute.name" = "SMGOV_BUSINESSGUID"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_business_guid"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidboth"
      + identity_provider_mapper = "saml-user-attribute-idp-mapper"
      + name                     = "bceid_business_guid"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.bceidboth.keycloak_custom_identity_provider_mapper.bceidboth_bceid_business_name will be created
  + resource "keycloak_custom_identity_provider_mapper" "bceidboth_bceid_business_name" {
      + extra_config             = {
          + "attribute.name" = "SMGOV_BUSINESSLEGALNAME"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_business_name"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidboth"
      + identity_provider_mapper = "saml-user-attribute-idp-mapper"
      + name                     = "bceid_business_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.bceidboth.keycloak_custom_identity_provider_mapper.bceidboth_bceid_user_guid will be created
  + resource "keycloak_custom_identity_provider_mapper" "bceidboth_bceid_user_guid" {
      + extra_config             = {
          + "attribute.name" = "useridentifier"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_user_guid"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidboth"
      + identity_provider_mapper = "saml-user-attribute-idp-mapper"
      + name                     = "bceid_user_guid"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.bceidboth.keycloak_custom_identity_provider_mapper.bceidboth_bceid_username will be created
  + resource "keycloak_custom_identity_provider_mapper" "bceidboth_bceid_username" {
      + extra_config             = {
          + "attribute.name" = "username"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_username"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidboth"
      + identity_provider_mapper = "saml-user-attribute-idp-mapper"
      + name                     = "bceid_username"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.bceidboth.keycloak_custom_identity_provider_mapper.bceidboth_displayname will be created
  + resource "keycloak_custom_identity_provider_mapper" "bceidboth_displayname" {
      + extra_config             = {
          + "attribute.name" = "displayName"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "display_name"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidboth"
      + identity_provider_mapper = "saml-user-attribute-idp-mapper"
      + name                     = "display_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.bceidboth.keycloak_custom_identity_provider_mapper.bceidboth_email will be created
  + resource "keycloak_custom_identity_provider_mapper" "bceidboth_email" {
      + extra_config             = {
          + "attribute.name" = "email"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "email"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidboth"
      + identity_provider_mapper = "saml-user-attribute-idp-mapper"
      + name                     = "email"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.bceidboth.keycloak_openid_client_scope.idp_scope will be created
  + resource "keycloak_openid_client_scope" "idp_scope" {
      + description            = "bceidboth idp client scope"
      + id                     = (known after apply)
      + include_in_token_scope = false
      + name                   = "bceidboth"
      + realm_id               = (known after apply)
    }

  # module.keycloak_dev.module.bceidbusiness.data.keycloak_authentication_execution.browser_identity_provider_redirector will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_authentication_execution" "browser_identity_provider_redirector" {
      + id                = (known after apply)
      + parent_flow_alias = "browser"
      + provider_id       = "****************************"
      + realm_id          = (known after apply)
    }

  # module.keycloak_dev.module.bceidbusiness.keycloak_authentication_execution_config.browser_identity_provider_redirector_config will be created
  + resource "keycloak_authentication_execution_config" "browser_identity_provider_redirector_config" {
      + alias        = "bceidbusiness"
      + config       = {
          + "defaultProvider" = "bceidbusiness"
        }
      + execution_id = (known after apply)
      + id           = (known after apply)
      + realm_id     = (known after apply)
    }

  # module.keycloak_dev.module.bceidbusiness.keycloak_custom_identity_provider_mapper.bceidbusiness_bceid_business_guid will be created
  + resource "keycloak_custom_identity_provider_mapper" "bceidbusiness_bceid_business_guid" {
      + extra_config             = {
          + "attribute.name" = "SMGOV_BUSINESSGUID"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_business_guid"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidbusiness"
      + identity_provider_mapper = "saml-user-attribute-idp-mapper"
      + name                     = "bceid_business_guid"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.bceidbusiness.keycloak_custom_identity_provider_mapper.bceidbusiness_bceid_business_name will be created
  + resource "keycloak_custom_identity_provider_mapper" "bceidbusiness_bceid_business_name" {
      + extra_config             = {
          + "attribute.name" = "SMGOV_BUSINESSLEGALNAME"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_business_name"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidbusiness"
      + identity_provider_mapper = "saml-user-attribute-idp-mapper"
      + name                     = "bceid_business_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.bceidbusiness.keycloak_custom_identity_provider_mapper.bceidbusiness_bceid_user_guid will be created
  + resource "keycloak_custom_identity_provider_mapper" "bceidbusiness_bceid_user_guid" {
      + extra_config             = {
          + "attribute.name" = "SMGOV_USERGUID"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_user_guid"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidbusiness"
      + identity_provider_mapper = "saml-user-attribute-idp-mapper"
      + name                     = "bceid_user_guid"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.bceidbusiness.keycloak_custom_identity_provider_mapper.bceidbusiness_bceid_username will be created
  + resource "keycloak_custom_identity_provider_mapper" "bceidbusiness_bceid_username" {
      + extra_config             = {
          + "attribute.name" = "username"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_username"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidbusiness"
      + identity_provider_mapper = "saml-user-attribute-idp-mapper"
      + name                     = "bceid_username"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.bceidbusiness.keycloak_custom_identity_provider_mapper.bceidbusiness_display_name will be created
  + resource "keycloak_custom_identity_provider_mapper" "bceidbusiness_display_name" {
      + extra_config             = {
          + "attribute.name" = "SMGOV_USERDISPLAYNAME"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "display_name"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidbusiness"
      + identity_provider_mapper = "saml-user-attribute-idp-mapper"
      + name                     = "display_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.bceidbusiness.keycloak_custom_identity_provider_mapper.bceidbusiness_email will be created
  + resource "keycloak_custom_identity_provider_mapper" "bceidbusiness_email" {
      + extra_config             = {
          + "attribute.name" = "email"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "email"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidbusiness"
      + identity_provider_mapper = "saml-user-attribute-idp-mapper"
      + name                     = "email"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.bceidbusiness.keycloak_openid_client_scope.idp_scope will be created
  + resource "keycloak_openid_client_scope" "idp_scope" {
      + description            = "bceidbusiness idp client scope"
      + id                     = (known after apply)
      + include_in_token_scope = false
      + name                   = "bceidbusiness"
      + realm_id               = (known after apply)
    }

  # module.keycloak_dev.module.bcsc.data.keycloak_authentication_execution.browser_identity_provider_redirector will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_authentication_execution" "browser_identity_provider_redirector" {
      + id                = (known after apply)
      + parent_flow_alias = "browser"
      + provider_id       = "****************************"
      + realm_id          = (known after apply)
    }

  # module.keycloak_dev.module.bcsc.keycloak_authentication_execution_config.browser_identity_provider_redirector_config will be created
  + resource "keycloak_authentication_execution_config" "browser_identity_provider_redirector_config" {
      + alias        = "bcsc"
      + config       = {
          + "defaultProvider" = "bcsc"
        }
      + execution_id = (known after apply)
      + id           = (known after apply)
      + realm_id     = (known after apply)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_displayname will be created
  + resource "keycloak_custom_identity_provider_mapper" "bcsc_displayname" {
      + extra_config             = {
          + "claim"          = "name"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "display_name"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "display_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_email will be created
  + resource "keycloak_custom_identity_provider_mapper" "bcsc_email" {
      + extra_config             = {
          + "claim"          = "email"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "email"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "email"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_firstname will be created
  + resource "keycloak_custom_identity_provider_mapper" "bcsc_firstname" {
      + extra_config             = {
          + "claim"          = "given_name"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "firstName"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "first_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_idir_user_guid will be created
  + resource "keycloak_custom_identity_provider_mapper" "bcsc_idir_user_guid" {
      + extra_config             = {
          + "claim"          = "bcgovGUID"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "idir_user_guid"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "idir_user_guid"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_idir_username will be created
  + resource "keycloak_custom_identity_provider_mapper" "bcsc_idir_username" {
      + extra_config             = {
          + "claim"          = "samaccountname"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "idir_username"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "idir_username"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_lastname will be created
  + resource "keycloak_custom_identity_provider_mapper" "bcsc_lastname" {
      + extra_config             = {
          + "claim"          = "family_name"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "lastName"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "last_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.bcsc.keycloak_openid_client_scope.idp_scope will be created
  + resource "keycloak_openid_client_scope" "idp_scope" {
      + description            = "bcsc idp client scope"
      + id                     = (known after apply)
      + include_in_token_scope = false
      + name                   = "bcsc"
      + realm_id               = (known after apply)
    }

  # module.keycloak_dev.module.idir.data.keycloak_authentication_execution.browser_identity_provider_redirector will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_authentication_execution" "browser_identity_provider_redirector" {
      + id                = (known after apply)
      + parent_flow_alias = "browser"
      + provider_id       = "****************************"
      + realm_id          = (known after apply)
    }

  # module.keycloak_dev.module.idir.keycloak_authentication_execution_config.browser_identity_provider_redirector_config will be created
  + resource "keycloak_authentication_execution_config" "browser_identity_provider_redirector_config" {
      + alias        = "idir"
      + config       = {
          + "defaultProvider" = "idir"
        }
      + execution_id = (known after apply)
      + id           = (known after apply)
      + realm_id     = (known after apply)
    }

  # module.keycloak_dev.module.idir.keycloak_custom_identity_provider_mapper.idir_displayname will be created
  + resource "keycloak_custom_identity_provider_mapper" "idir_displayname" {
      + extra_config             = {
          + "attribute.name" = "displayname"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "display_name"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "idir"
      + identity_provider_mapper = "saml-user-attribute-idp-mapper"
      + name                     = "display_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.idir.keycloak_custom_identity_provider_mapper.idir_email will be created
  + resource "keycloak_custom_identity_provider_mapper" "idir_email" {
      + extra_config             = {
          + "attribute.name" = "email"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "email"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "idir"
      + identity_provider_mapper = "saml-user-attribute-idp-mapper"
      + name                     = "email"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.idir.keycloak_custom_identity_provider_mapper.idir_firstname will be created
  + resource "keycloak_custom_identity_provider_mapper" "idir_firstname" {
      + extra_config             = {
          + "attribute.name" = "firstname"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "firstName"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "idir"
      + identity_provider_mapper = "saml-user-attribute-idp-mapper"
      + name                     = "first_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.idir.keycloak_custom_identity_provider_mapper.idir_idir_user_guid will be created
  + resource "keycloak_custom_identity_provider_mapper" "idir_idir_user_guid" {
      + extra_config             = {
          + "attribute.name" = "useridentifier"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "idir_user_guid"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "idir"
      + identity_provider_mapper = "saml-user-attribute-idp-mapper"
      + name                     = "idir_user_guid"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.idir.keycloak_custom_identity_provider_mapper.idir_idir_username will be created
  + resource "keycloak_custom_identity_provider_mapper" "idir_idir_username" {
      + extra_config             = {
          + "attribute.name" = "username"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "idir_username"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "idir"
      + identity_provider_mapper = "saml-user-attribute-idp-mapper"
      + name                     = "idir_username"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.idir.keycloak_custom_identity_provider_mapper.idir_lastname will be created
  + resource "keycloak_custom_identity_provider_mapper" "idir_lastname" {
      + extra_config             = {
          + "attribute.name" = "lastname"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "lastName"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "idir"
      + identity_provider_mapper = "saml-user-attribute-idp-mapper"
      + name                     = "last_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.idir.keycloak_openid_client_scope.idp_scope will be created
  + resource "keycloak_openid_client_scope" "idp_scope" {
      + description            = "idir idp client scope"
      + id                     = (known after apply)
      + include_in_token_scope = false
      + name                   = "idir"
      + realm_id               = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "***************"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["bceidbasic"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "****************"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["bceidboth"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "***************"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["bceidbusiness"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "*******************"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["idir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "**********"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "************"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "**************"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_realm.master will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "keycloak_realm" "master" {
      + access_code_lifespan                     = (known after apply)
      + access_code_lifespan_login               = (known after apply)
      + access_code_lifespan_user_action         = (known after apply)
      + access_token_lifespan                    = (known after apply)
      + access_token_lifespan_for_implicit_flow  = (known after apply)
      + account_theme                            = (known after apply)
      + action_token_generated_by_admin_lifespan = (known after apply)
      + action_token_generated_by_user_lifespan  = (known after apply)
      + admin_theme                              = (known after apply)
      + attributes                               = (known after apply)
      + browser_flow                             = (known after apply)
      + client_authentication_flow               = (known after apply)
      + client_session_idle_timeout              = (known after apply)
      + client_session_max_lifespan              = (known after apply)
      + default_default_client_scopes            = (known after apply)
      + default_optional_client_scopes           = (known after apply)
      + default_signature_algorithm              = (known after apply)
      + direct_grant_flow                        = (known after apply)
      + display_name                             = (known after apply)
      + docker_authentication_flow               = (known after apply)
      + duplicate_emails_allowed                 = (known after apply)
      + edit_username_allowed                    = (known after apply)
      + email_theme                              = (known after apply)
      + enabled                                  = (known after apply)
      + id                                       = (known after apply)
      + internal_id                              = (known after apply)
      + login_theme                              = (known after apply)
      + login_with_email_allowed                 = (known after apply)
      + oauth2_device_code_lifespan              = (known after apply)
      + oauth2_device_polling_interval           = (known after apply)
      + offline_session_idle_timeout             = (known after apply)
      + offline_session_max_lifespan             = (known after apply)
      + offline_session_max_lifespan_enabled     = (known after apply)
      + password_policy                          = (known after apply)
      + realm                                    = "master"
      + refresh_token_max_reuse                  = (known after apply)
      + registration_allowed                     = (known after apply)
      + registration_email_as_username           = (known after apply)
      + registration_flow                        = (known after apply)
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = (known after apply)
      + ssl_required                             = (known after apply)
      + sso_session_idle_timeout                 = (known after apply)
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = (known after apply)
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = (known after apply)
      + verify_email                             = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["bceidbasic"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["bceidboth"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["bceidbusiness"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["idir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["bceidbasic"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["bceidboth"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["bceidbusiness"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["idir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["bceidbasic"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["bceidboth"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["bceidbusiness"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["idir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["bceidbasic"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["bceidboth"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["bceidbusiness"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["idir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["bceidbasic"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["bceidboth"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["bceidbusiness"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["idir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["bceidbasic"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["bceidboth"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["bceidbusiness"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["idir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.keycloak_openid_client.viewer_service_account will be created
  + resource "keycloak_openid_client" "viewer_service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "*********"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "viwer-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_dev.module.master_viewer_role.keycloak_openid_client_service_account_realm_role.viewer_service_account_viewer_role will be created
  + resource "keycloak_openid_client_service_account_realm_role" "viewer_service_account_viewer_role" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "viewer"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.keycloak_role.viewer will be created
  + resource "keycloak_role" "viewer" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "viewer"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.keycloak_custom_identity_provider_mapper.azureidir_username will be created
  + resource "keycloak_custom_identity_provider_mapper" "azureidir_username" {
      + extra_config             = {
          + "syncMode" = "INHERIT"
          + "template" = "${CLAIM.preferred_username}@${ALIAS}"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "azureidir"
      + identity_provider_mapper = "oidc-username-idp-mapper"
      + name                     = "username"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.keycloak_custom_identity_provider_mapper.bceidbasic_username will be created
  + resource "keycloak_custom_identity_provider_mapper" "bceidbasic_username" {
      + extra_config             = {
          + "syncMode" = "INHERIT"
          + "template" = "${CLAIM.preferred_username}@${ALIAS}"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidbasic"
      + identity_provider_mapper = "oidc-username-idp-mapper"
      + name                     = "username"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.keycloak_custom_identity_provider_mapper.bceidboth_username will be created
  + resource "keycloak_custom_identity_provider_mapper" "bceidboth_username" {
      + extra_config             = {
          + "syncMode" = "INHERIT"
          + "template" = "${CLAIM.preferred_username}@${ALIAS}"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidboth"
      + identity_provider_mapper = "oidc-username-idp-mapper"
      + name                     = "username"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.keycloak_custom_identity_provider_mapper.bceidbusiness_username will be created
  + resource "keycloak_custom_identity_provider_mapper" "bceidbusiness_username" {
      + extra_config             = {
          + "syncMode" = "INHERIT"
          + "template" = "${CLAIM.preferred_username}@${ALIAS}"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidbusiness"
      + identity_provider_mapper = "oidc-username-idp-mapper"
      + name                     = "username"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.keycloak_custom_identity_provider_mapper.bcsc_username will be created
  + resource "keycloak_custom_identity_provider_mapper" "bcsc_username" {
      + extra_config             = {
          + "syncMode" = "INHERIT"
          + "template" = "${CLAIM.preferred_username}@${ALIAS}"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc"
      + identity_provider_mapper = "oidc-username-idp-mapper"
      + name                     = "username"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.keycloak_custom_identity_provider_mapper.idir_username will be created
  + resource "keycloak_custom_identity_provider_mapper" "idir_username" {
      + extra_config             = {
          + "syncMode" = "INHERIT"
          + "template" = "${CLAIM.preferred_username}@${ALIAS}"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "idir"
      + identity_provider_mapper = "oidc-username-idp-mapper"
      + name                     = "username"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.keycloak_openid_client.test_client will be created
  + resource "keycloak_openid_client" "test_client" {
      + access_type                               = "PUBLIC"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "***********"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "test_client"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "*",
        ]
      + web_origins                               = [
          + "*",
        ]

      + authentication_flow_binding_overrides {
          + browser_id = (known after apply)
        }
    }

  # module.keycloak_dev.module.standard.keycloak_openid_client_default_scopes.client_standard_default_scopes will be created
  + resource "keycloak_openid_client_default_scopes" "client_standard_default_scopes" {
      + client_id      = (known after apply)
      + default_scopes = [
          + "email",
          + "profile",
        ]
      + id             = (known after apply)
      + realm_id       = (known after apply)
    }

  # module.keycloak_dev.module.standard.keycloak_role.admin_role will be created
  + resource "keycloak_role" "admin_role" {
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "admin_role"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.keycloak_role.client_role1 will be created
  + resource "keycloak_role" "client_role1" {
      + client_id   = (known after apply)
      + description = "client_role1"
      + id          = (known after apply)
      + name        = "client_role1"
      + realm_id    = (known after apply)
    }

  # module.keycloak_dev.module.standard.keycloak_role.client_role2 will be created
  + resource "keycloak_role" "client_role2" {
      + client_id   = (known after apply)
      + description = "client_role2"
      + id          = (known after apply)
      + name        = "client_role2"
      + realm_id    = (known after apply)
    }

  # module.keycloak_dev.module.standard_clients.data.keycloak_authentication_flow.demo_testing_5_16_3644_browserflow will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_authentication_flow" "demo_testing_5_16_3644_browserflow" {
      + alias    = "idp stopper"
      + id       = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_dev.module.azureidir.module.azureidir_idp.keycloak_oidc_identity_provider.this will be created
  + resource "keycloak_oidc_identity_provider" "this" {
      + accepts_prompt_none_forward_from_client = false
      + add_read_token_role_on_create           = false
      + alias                                   = "azureidir"
      + authenticate_by_default                 = false
      + authorization_url                       = "https://login.microsoftonline.com/abcde/oauth2/v2.0/auth"
      + backchannel_supported                   = true
      + client_id                               = "***********"
      + client_secret                           = (sensitive value)
      + default_scopes                          = "openid"
      + disable_user_info                       = false
      + display_name                            = "azureidir"
      + enabled                                 = true
      + extra_config                            = {
          + "clientAuthMethod" = "client_secret_post"
        }
      + first_broker_login_flow_alias           = "first broker login"
      + hide_on_login_page                      = false
      + id                                      = (known after apply)
      + internal_id                             = (known after apply)
      + link_only                               = false
      + login_hint                              = "false"
      + provider_id                             = "****"
      + realm                                   = (known after apply)
      + store_token                             = false
      + sync_mode                               = "FORCE"
      + token_url                               = "https://login.microsoftonline.com/abcde/oauth2/v2.0/token"
      + trust_email                             = false
      + ui_locales                              = false
      + user_info_url                           = "https://login.microsoftonline.com/abcde/oauth2/v2.0/userinfo"
      + validate_signature                      = true
    }

  # module.keycloak_dev.module.azureidir.module.realm.keycloak_realm.this will be created
  + resource "keycloak_realm" "this" {
      + access_code_lifespan                     = "1m"
      + access_code_lifespan_login               = "30m"
      + access_code_lifespan_user_action         = "5m"
      + access_token_lifespan                    = "**"
      + access_token_lifespan_for_implicit_flow  = "***"
      + action_token_generated_by_admin_lifespan = "***"
      + action_token_generated_by_user_lifespan  = "**"
      + browser_flow                             = (known after apply)
      + client_authentication_flow               = (known after apply)
      + client_session_idle_timeout              = (known after apply)
      + client_session_max_lifespan              = (known after apply)
      + direct_grant_flow                        = (known after apply)
      + display_name                             = "azureidir"
      + display_name_html                        = "<b>azureidir</b>"
      + docker_authentication_flow               = (known after apply)
      + duplicate_emails_allowed                 = true
      + edit_username_allowed                    = (known after apply)
      + enabled                                  = true
      + id                                       = (known after apply)
      + internal_id                              = (known after apply)
      + login_theme                              = "bcgov"
      + login_with_email_allowed                 = false
      + oauth2_device_code_lifespan              = (known after apply)
      + oauth2_device_polling_interval           = (known after apply)
      + offline_session_idle_timeout             = "****"
      + offline_session_max_lifespan             = (known after apply)
      + offline_session_max_lifespan_enabled     = false
      + realm                                    = "azureidir"
      + refresh_token_max_reuse                  = 0
      + registration_allowed                     = (known after apply)
      + registration_email_as_username           = (known after apply)
      + registration_flow                        = (known after apply)
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = true
      + ssl_required                             = "external"
      + sso_session_idle_timeout                 = "***"
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = "10h"
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = false
      + verify_email                             = (known after apply)

      + otp_policy {
          + algorithm         = (known after apply)
          + digits            = (known after apply)
          + initial_counter   = (known after apply)
          + look_ahead_window = (known after apply)
          + period            = (known after apply)
          + type              = (known after apply)
        }

      + web_authn_passwordless_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }

      + web_authn_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }
    }

  # module.keycloak_dev.module.azureidir.module.standard_client.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "**************"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "standard-realm"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/standard/broker/azureidir/endpoint",
        ]
    }

  # module.keycloak_dev.module.azureidir.module.standard_client.keycloak_openid_client_default_scopes.client_default_scopes will be created
  + resource "keycloak_openid_client_default_scopes" "client_default_scopes" {
      + client_id      = (known after apply)
      + default_scopes = [
          + "email",
          + "profile",
        ]
      + id             = (known after apply)
      + realm_id       = (known after apply)
    }

  # module.keycloak_dev.module.azureidir.module.standard_client.keycloak_openid_client_optional_scopes.client_optional_scopes will be created
  + resource "keycloak_openid_client_optional_scopes" "client_optional_scopes" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + optional_scopes = [
          + "offline_access",
        ]
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.bceidbasic.module.bceidbasic_idp.keycloak_saml_identity_provider.this will be created
  + resource "keycloak_saml_identity_provider" "this" {
      + add_read_token_role_on_create = false
      + alias                         = "bceidbasic"
      + authenticate_by_default       = false
      + backchannel_supported         = false
      + display_name                  = "bceidbasic"
      + enabled                       = true
      + entity_id                     = "*********************************************************"
      + extra_config                  = {
          + "authnContextComparisonType" = "exact"
        }
      + first_broker_login_flow_alias = "first broker login"
      + force_authn                   = true
      + gui_order                     = ""
      + hide_on_login_page            = false
      + id                            = (known after apply)
      + internal_id                   = (known after apply)
      + link_only                     = false
      + name_id_policy_format         = "****************************************************"
      + post_binding_authn_request    = true
      + post_binding_logout           = false
      + post_binding_response         = true
      + post_broker_login_flow_alias  = ""
      + principal_type                = "SUBJECT"
      + provider_id                   = "****"
      + realm                         = (known after apply)
      + signing_certificate           = (sensitive)
      + single_logout_service_url     = ""
      + single_sign_on_service_url    = "https://sfstest7.gov.bc.ca/affwebservices/public/saml2sso"
      + store_token                   = false
      + sync_mode                     = "FORCE"
      + trust_email                   = false
      + validate_signature            = true
      + want_assertions_encrypted     = false
      + want_assertions_signed        = false
    }

  # module.keycloak_dev.module.bceidbasic.module.realm.keycloak_realm.this will be created
  + resource "keycloak_realm" "this" {
      + access_code_lifespan                     = "1m"
      + access_code_lifespan_login               = "30m"
      + access_code_lifespan_user_action         = "5m"
      + access_token_lifespan                    = "**"
      + access_token_lifespan_for_implicit_flow  = "***"
      + action_token_generated_by_admin_lifespan = "***"
      + action_token_generated_by_user_lifespan  = "**"
      + browser_flow                             = (known after apply)
      + client_authentication_flow               = (known after apply)
      + client_session_idle_timeout              = (known after apply)
      + client_session_max_lifespan              = (known after apply)
      + direct_grant_flow                        = (known after apply)
      + display_name                             = "bceidbasic"
      + display_name_html                        = "<b>bceidbasic</b>"
      + docker_authentication_flow               = (known after apply)
      + duplicate_emails_allowed                 = true
      + edit_username_allowed                    = (known after apply)
      + enabled                                  = true
      + id                                       = (known after apply)
      + internal_id                              = (known after apply)
      + login_theme                              = "bcgov"
      + login_with_email_allowed                 = false
      + oauth2_device_code_lifespan              = (known after apply)
      + oauth2_device_polling_interval           = (known after apply)
      + offline_session_idle_timeout             = "****"
      + offline_session_max_lifespan             = (known after apply)
      + offline_session_max_lifespan_enabled     = false
      + realm                                    = "bceidbasic"
      + refresh_token_max_reuse                  = 0
      + registration_allowed                     = (known after apply)
      + registration_email_as_username           = (known after apply)
      + registration_flow                        = (known after apply)
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = true
      + ssl_required                             = "external"
      + sso_session_idle_timeout                 = "***"
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = "10h"
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = false
      + verify_email                             = (known after apply)

      + otp_policy {
          + algorithm         = (known after apply)
          + digits            = (known after apply)
          + initial_counter   = (known after apply)
          + look_ahead_window = (known after apply)
          + period            = (known after apply)
          + type              = (known after apply)
        }

      + web_authn_passwordless_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }

      + web_authn_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }
    }

  # module.keycloak_dev.module.bceidbasic.module.standard_client.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "**************"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "standard-realm"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/standard/broker/bceidbasic/endpoint",
        ]
    }

  # module.keycloak_dev.module.bceidbasic.module.standard_client.keycloak_openid_client_default_scopes.client_default_scopes will be created
  + resource "keycloak_openid_client_default_scopes" "client_default_scopes" {
      + client_id      = (known after apply)
      + default_scopes = [
          + "email",
          + "profile",
        ]
      + id             = (known after apply)
      + realm_id       = (known after apply)
    }

  # module.keycloak_dev.module.bceidbasic.module.standard_client.keycloak_openid_client_optional_scopes.client_optional_scopes will be created
  + resource "keycloak_openid_client_optional_scopes" "client_optional_scopes" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + optional_scopes = [
          + "offline_access",
        ]
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.bceidboth.module.bceidboth_idp.keycloak_saml_identity_provider.this will be created
  + resource "keycloak_saml_identity_provider" "this" {
      + add_read_token_role_on_create = false
      + alias                         = "bceidboth"
      + authenticate_by_default       = false
      + backchannel_supported         = false
      + display_name                  = "bceidboth"
      + enabled                       = true
      + entity_id                     = "*****************************************************************"
      + extra_config                  = {
          + "authnContextComparisonType" = "exact"
        }
      + first_broker_login_flow_alias = "first broker login"
      + force_authn                   = true
      + gui_order                     = ""
      + hide_on_login_page            = false
      + id                            = (known after apply)
      + internal_id                   = (known after apply)
      + link_only                     = false
      + name_id_policy_format         = "****************************************************"
      + post_binding_authn_request    = true
      + post_binding_logout           = false
      + post_binding_response         = true
      + post_broker_login_flow_alias  = ""
      + principal_type                = "SUBJECT"
      + provider_id                   = "****"
      + realm                         = (known after apply)
      + signing_certificate           = (sensitive)
      + single_logout_service_url     = ""
      + single_sign_on_service_url    = "https://sfstest7.gov.bc.ca/affwebservices/public/saml2sso"
      + store_token                   = false
      + sync_mode                     = "FORCE"
      + trust_email                   = false
      + validate_signature            = true
      + want_assertions_encrypted     = false
      + want_assertions_signed        = false
    }

  # module.keycloak_dev.module.bceidboth.module.realm.keycloak_realm.this will be created
  + resource "keycloak_realm" "this" {
      + access_code_lifespan                     = "1m"
      + access_code_lifespan_login               = "30m"
      + access_code_lifespan_user_action         = "5m"
      + access_token_lifespan                    = "**"
      + access_token_lifespan_for_implicit_flow  = "***"
      + action_token_generated_by_admin_lifespan = "***"
      + action_token_generated_by_user_lifespan  = "**"
      + browser_flow                             = (known after apply)
      + client_authentication_flow               = (known after apply)
      + client_session_idle_timeout              = (known after apply)
      + client_session_max_lifespan              = (known after apply)
      + direct_grant_flow                        = (known after apply)
      + display_name                             = "bceidboth"
      + display_name_html                        = "<b>bceidboth</b>"
      + docker_authentication_flow               = (known after apply)
      + duplicate_emails_allowed                 = true
      + edit_username_allowed                    = (known after apply)
      + enabled                                  = true
      + id                                       = (known after apply)
      + internal_id                              = (known after apply)
      + login_theme                              = "bcgov"
      + login_with_email_allowed                 = false
      + oauth2_device_code_lifespan              = (known after apply)
      + oauth2_device_polling_interval           = (known after apply)
      + offline_session_idle_timeout             = "****"
      + offline_session_max_lifespan             = (known after apply)
      + offline_session_max_lifespan_enabled     = false
      + realm                                    = "bceidboth"
      + refresh_token_max_reuse                  = 0
      + registration_allowed                     = (known after apply)
      + registration_email_as_username           = (known after apply)
      + registration_flow                        = (known after apply)
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = true
      + ssl_required                             = "external"
      + sso_session_idle_timeout                 = "***"
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = "10h"
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = false
      + verify_email                             = (known after apply)

      + otp_policy {
          + algorithm         = (known after apply)
          + digits            = (known after apply)
          + initial_counter   = (known after apply)
          + look_ahead_window = (known after apply)
          + period            = (known after apply)
          + type              = (known after apply)
        }

      + web_authn_passwordless_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }

      + web_authn_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }
    }

  # module.keycloak_dev.module.bceidboth.module.standard_client.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "**************"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "standard-realm"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/standard/broker/bceidboth/endpoint",
        ]
    }

  # module.keycloak_dev.module.bceidboth.module.standard_client.keycloak_openid_client_default_scopes.client_default_scopes will be created
  + resource "keycloak_openid_client_default_scopes" "client_default_scopes" {
      + client_id      = (known after apply)
      + default_scopes = [
          + "email",
          + "profile",
        ]
      + id             = (known after apply)
      + realm_id       = (known after apply)
    }

  # module.keycloak_dev.module.bceidboth.module.standard_client.keycloak_openid_client_optional_scopes.client_optional_scopes will be created
  + resource "keycloak_openid_client_optional_scopes" "client_optional_scopes" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + optional_scopes = [
          + "offline_access",
        ]
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.bceidbusiness.module.bceidbusiness_idp.keycloak_saml_identity_provider.this will be created
  + resource "keycloak_saml_identity_provider" "this" {
      + add_read_token_role_on_create = false
      + alias                         = "bceidbusiness"
      + authenticate_by_default       = false
      + backchannel_supported         = false
      + display_name                  = "bceidbusiness"
      + enabled                       = true
      + entity_id                     = "************************************************************"
      + extra_config                  = {
          + "authnContextComparisonType" = "exact"
        }
      + first_broker_login_flow_alias = "first broker login"
      + force_authn                   = true
      + gui_order                     = ""
      + hide_on_login_page            = false
      + id                            = (known after apply)
      + internal_id                   = (known after apply)
      + link_only                     = false
      + name_id_policy_format         = "****************************************************"
      + post_binding_authn_request    = true
      + post_binding_logout           = false
      + post_binding_response         = true
      + post_broker_login_flow_alias  = ""
      + principal_type                = "SUBJECT"
      + provider_id                   = "****"
      + realm                         = (known after apply)
      + signing_certificate           = (sensitive)
      + single_logout_service_url     = ""
      + single_sign_on_service_url    = "https://sfstest7.gov.bc.ca/affwebservices/public/saml2sso"
      + store_token                   = false
      + sync_mode                     = "FORCE"
      + trust_email                   = false
      + validate_signature            = true
      + want_assertions_encrypted     = false
      + want_assertions_signed        = false
    }

  # module.keycloak_dev.module.bceidbusiness.module.realm.keycloak_realm.this will be created
  + resource "keycloak_realm" "this" {
      + access_code_lifespan                     = "1m"
      + access_code_lifespan_login               = "30m"
      + access_code_lifespan_user_action         = "5m"
      + access_token_lifespan                    = "**"
      + access_token_lifespan_for_implicit_flow  = "***"
      + action_token_generated_by_admin_lifespan = "***"
      + action_token_generated_by_user_lifespan  = "**"
      + browser_flow                             = (known after apply)
      + client_authentication_flow               = (known after apply)
      + client_session_idle_timeout              = (known after apply)
      + client_session_max_lifespan              = (known after apply)
      + direct_grant_flow                        = (known after apply)
      + display_name                             = "bceidbusiness"
      + display_name_html                        = "<b>bceidbusiness</b>"
      + docker_authentication_flow               = (known after apply)
      + duplicate_emails_allowed                 = true
      + edit_username_allowed                    = (known after apply)
      + enabled                                  = true
      + id                                       = (known after apply)
      + internal_id                              = (known after apply)
      + login_theme                              = "bcgov"
      + login_with_email_allowed                 = false
      + oauth2_device_code_lifespan              = (known after apply)
      + oauth2_device_polling_interval           = (known after apply)
      + offline_session_idle_timeout             = "****"
      + offline_session_max_lifespan             = (known after apply)
      + offline_session_max_lifespan_enabled     = false
      + realm                                    = "bceidbusiness"
      + refresh_token_max_reuse                  = 0
      + registration_allowed                     = (known after apply)
      + registration_email_as_username           = (known after apply)
      + registration_flow                        = (known after apply)
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = true
      + ssl_required                             = "external"
      + sso_session_idle_timeout                 = "***"
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = "10h"
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = false
      + verify_email                             = (known after apply)

      + otp_policy {
          + algorithm         = (known after apply)
          + digits            = (known after apply)
          + initial_counter   = (known after apply)
          + look_ahead_window = (known after apply)
          + period            = (known after apply)
          + type              = (known after apply)
        }

      + web_authn_passwordless_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }

      + web_authn_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }
    }

  # module.keycloak_dev.module.bceidbusiness.module.standard_client.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "**************"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "standard-realm"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/standard/broker/bceidbusiness/endpoint",
        ]
    }

  # module.keycloak_dev.module.bceidbusiness.module.standard_client.keycloak_openid_client_default_scopes.client_default_scopes will be created
  + resource "keycloak_openid_client_default_scopes" "client_default_scopes" {
      + client_id      = (known after apply)
      + default_scopes = [
          + "email",
          + "profile",
        ]
      + id             = (known after apply)
      + realm_id       = (known after apply)
    }

  # module.keycloak_dev.module.bceidbusiness.module.standard_client.keycloak_openid_client_optional_scopes.client_optional_scopes will be created
  + resource "keycloak_openid_client_optional_scopes" "client_optional_scopes" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + optional_scopes = [
          + "offline_access",
        ]
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.bcsc.module.bcsc_idp.keycloak_oidc_identity_provider.this will be created
  + resource "keycloak_oidc_identity_provider" "this" {
      + accepts_prompt_none_forward_from_client = false
      + add_read_token_role_on_create           = false
      + alias                                   = "bcsc"
      + authenticate_by_default                 = false
      + authorization_url                       = "https://keycloak.freshworks.club/auth/realms/social-sector-portal-test/protocol/openid-connect/auth"
      + backchannel_supported                   = true
      + client_id                               = "***********"
      + client_secret                           = (sensitive value)
      + default_scopes                          = "openid"
      + disable_user_info                       = false
      + display_name                            = "bcsc"
      + enabled                                 = true
      + extra_config                            = {
          + "clientAuthMethod" = "client_secret_post"
        }
      + first_broker_login_flow_alias           = "first broker login"
      + hide_on_login_page                      = false
      + id                                      = (known after apply)
      + internal_id                             = (known after apply)
      + link_only                               = false
      + login_hint                              = "false"
      + provider_id                             = "****"
      + realm                                   = (known after apply)
      + store_token                             = false
      + sync_mode                               = "FORCE"
      + token_url                               = "https://keycloak.freshworks.club/auth/realms/social-sector-portal-test/protocol/openid-connect/token"
      + trust_email                             = false
      + ui_locales                              = false
      + user_info_url                           = "https://keycloak.freshworks.club/auth/realms/social-sector-portal-test/protocol/openid-connect/userinfo"
      + validate_signature                      = true
    }

  # module.keycloak_dev.module.bcsc.module.realm.keycloak_realm.this will be created
  + resource "keycloak_realm" "this" {
      + access_code_lifespan                     = "1m"
      + access_code_lifespan_login               = "30m"
      + access_code_lifespan_user_action         = "5m"
      + access_token_lifespan                    = "**"
      + access_token_lifespan_for_implicit_flow  = "***"
      + action_token_generated_by_admin_lifespan = "***"
      + action_token_generated_by_user_lifespan  = "**"
      + browser_flow                             = (known after apply)
      + client_authentication_flow               = (known after apply)
      + client_session_idle_timeout              = (known after apply)
      + client_session_max_lifespan              = (known after apply)
      + direct_grant_flow                        = (known after apply)
      + display_name                             = "bcsc"
      + display_name_html                        = "<b>bcsc</b>"
      + docker_authentication_flow               = (known after apply)
      + duplicate_emails_allowed                 = true
      + edit_username_allowed                    = (known after apply)
      + enabled                                  = true
      + id                                       = (known after apply)
      + internal_id                              = (known after apply)
      + login_theme                              = "bcgov"
      + login_with_email_allowed                 = false
      + oauth2_device_code_lifespan              = (known after apply)
      + oauth2_device_polling_interval           = (known after apply)
      + offline_session_idle_timeout             = "****"
      + offline_session_max_lifespan             = (known after apply)
      + offline_session_max_lifespan_enabled     = false
      + realm                                    = "bcsc"
      + refresh_token_max_reuse                  = 0
      + registration_allowed                     = (known after apply)
      + registration_email_as_username           = (known after apply)
      + registration_flow                        = (known after apply)
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = true
      + ssl_required                             = "external"
      + sso_session_idle_timeout                 = "***"
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = "10h"
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = false
      + verify_email                             = (known after apply)

      + otp_policy {
          + algorithm         = (known after apply)
          + digits            = (known after apply)
          + initial_counter   = (known after apply)
          + look_ahead_window = (known after apply)
          + period            = (known after apply)
          + type              = (known after apply)
        }

      + web_authn_passwordless_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }

      + web_authn_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "**************"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "standard-realm"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/standard/broker/bcsc/endpoint",
        ]
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.keycloak_openid_client_default_scopes.client_default_scopes will be created
  + resource "keycloak_openid_client_default_scopes" "client_default_scopes" {
      + client_id      = (known after apply)
      + default_scopes = [
          + "email",
          + "profile",
        ]
      + id             = (known after apply)
      + realm_id       = (known after apply)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.keycloak_openid_client_optional_scopes.client_optional_scopes will be created
  + resource "keycloak_openid_client_optional_scopes" "client_optional_scopes" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + optional_scopes = [
          + "offline_access",
        ]
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.idir.module.idir_idp.keycloak_saml_identity_provider.this will be created
  + resource "keycloak_saml_identity_provider" "this" {
      + add_read_token_role_on_create = false
      + alias                         = "idir"
      + authenticate_by_default       = false
      + backchannel_supported         = false
      + display_name                  = "idir"
      + enabled                       = true
      + entity_id                     = "***************************************************"
      + extra_config                  = {
          + "authnContextComparisonType" = "exact"
        }
      + first_broker_login_flow_alias = "first broker login"
      + force_authn                   = true
      + gui_order                     = ""
      + hide_on_login_page            = false
      + id                            = (known after apply)
      + internal_id                   = (known after apply)
      + link_only                     = false
      + name_id_policy_format         = "****************************************************"
      + post_binding_authn_request    = true
      + post_binding_logout           = false
      + post_binding_response         = true
      + post_broker_login_flow_alias  = ""
      + principal_type                = "SUBJECT"
      + provider_id                   = "****"
      + realm                         = (known after apply)
      + signing_certificate           = (sensitive)
      + single_logout_service_url     = ""
      + single_sign_on_service_url    = "https://sfstest7.gov.bc.ca/affwebservices/public/saml2sso"
      + store_token                   = false
      + sync_mode                     = "FORCE"
      + trust_email                   = false
      + validate_signature            = true
      + want_assertions_encrypted     = false
      + want_assertions_signed        = false
    }

  # module.keycloak_dev.module.idir.module.realm.keycloak_realm.this will be created
  + resource "keycloak_realm" "this" {
      + access_code_lifespan                     = "1m"
      + access_code_lifespan_login               = "30m"
      + access_code_lifespan_user_action         = "5m"
      + access_token_lifespan                    = "**"
      + access_token_lifespan_for_implicit_flow  = "***"
      + action_token_generated_by_admin_lifespan = "***"
      + action_token_generated_by_user_lifespan  = "**"
      + browser_flow                             = (known after apply)
      + client_authentication_flow               = (known after apply)
      + client_session_idle_timeout              = (known after apply)
      + client_session_max_lifespan              = (known after apply)
      + direct_grant_flow                        = (known after apply)
      + display_name                             = "idir"
      + display_name_html                        = "<b>idir</b>"
      + docker_authentication_flow               = (known after apply)
      + duplicate_emails_allowed                 = true
      + edit_username_allowed                    = (known after apply)
      + enabled                                  = true
      + id                                       = (known after apply)
      + internal_id                              = (known after apply)
      + login_theme                              = "bcgov"
      + login_with_email_allowed                 = false
      + oauth2_device_code_lifespan              = (known after apply)
      + oauth2_device_polling_interval           = (known after apply)
      + offline_session_idle_timeout             = "****"
      + offline_session_max_lifespan             = (known after apply)
      + offline_session_max_lifespan_enabled     = false
      + realm                                    = "idir"
      + refresh_token_max_reuse                  = 0
      + registration_allowed                     = (known after apply)
      + registration_email_as_username           = (known after apply)
      + registration_flow                        = (known after apply)
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = true
      + ssl_required                             = "external"
      + sso_session_idle_timeout                 = "***"
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = "10h"
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = false
      + verify_email                             = (known after apply)

      + otp_policy {
          + algorithm         = (known after apply)
          + digits            = (known after apply)
          + initial_counter   = (known after apply)
          + look_ahead_window = (known after apply)
          + period            = (known after apply)
          + type              = (known after apply)
        }

      + web_authn_passwordless_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }

      + web_authn_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }
    }

  # module.keycloak_dev.module.idir.module.standard_client.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "**************"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "standard-realm"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/standard/broker/idir/endpoint",
        ]
    }

  # module.keycloak_dev.module.idir.module.standard_client.keycloak_openid_client_default_scopes.client_default_scopes will be created
  + resource "keycloak_openid_client_default_scopes" "client_default_scopes" {
      + client_id      = (known after apply)
      + default_scopes = [
          + "email",
          + "profile",
        ]
      + id             = (known after apply)
      + realm_id       = (known after apply)
    }

  # module.keycloak_dev.module.idir.module.standard_client.keycloak_openid_client_optional_scopes.client_optional_scopes will be created
  + resource "keycloak_openid_client_optional_scopes" "client_optional_scopes" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + optional_scopes = [
          + "offline_access",
        ]
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_idir_link.module.idp_client.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "************"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "master-realm"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/master/broker/idir/endpoint",
        ]
    }

  # module.keycloak_dev.module.master_idir_link.module.idp_client.keycloak_openid_client_default_scopes.client_default_scopes will be created
  + resource "keycloak_openid_client_default_scopes" "client_default_scopes" {
      + client_id      = (known after apply)
      + default_scopes = [
          + "email",
          + "profile",
        ]
      + id             = (known after apply)
      + realm_id       = (known after apply)
    }

  # module.keycloak_dev.module.master_idir_link.module.idp_client.keycloak_openid_client_optional_scopes.client_optional_scopes will be created
  + resource "keycloak_openid_client_optional_scopes" "client_optional_scopes" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + optional_scopes = [
          + "offline_access",
        ]
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_idir_link.module.master_idp.keycloak_oidc_identity_provider.this will be created
  + resource "keycloak_oidc_identity_provider" "this" {
      + accepts_prompt_none_forward_from_client = false
      + add_read_token_role_on_create           = false
      + alias                                   = "idir"
      + authenticate_by_default                 = false
      + authorization_url                       = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/idir/protocol/openid-connect/auth"
      + backchannel_supported                   = true
      + client_id                               = "************"
      + client_secret                           = (sensitive value)
      + default_scopes                          = "openid"
      + disable_user_info                       = false
      + display_name                            = "idir"
      + enabled                                 = true
      + extra_config                            = {
          + "clientAuthMethod" = "client_secret_post"
        }
      + first_broker_login_flow_alias           = "first broker login"
      + gui_order                               = ""
      + hide_on_login_page                      = false
      + id                                      = (known after apply)
      + internal_id                             = (known after apply)
      + jwks_url                                = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/idir/protocol/openid-connect/certs"
      + link_only                               = false
      + login_hint                              = "false"
      + logout_url                              = ""
      + post_broker_login_flow_alias            = ""
      + provider_id                             = "****"
      + realm                                   = "master"
      + store_token                             = false
      + sync_mode                               = "FORCE"
      + token_url                               = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/idir/protocol/openid-connect/token"
      + trust_email                             = false
      + ui_locales                              = false
      + user_info_url                           = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/idir/protocol/openid-connect/userinfo"
      + validate_signature                      = true
    }

  # module.keycloak_dev.module.standard.module.azureidir_idp.keycloak_oidc_identity_provider.this will be created
  + resource "keycloak_oidc_identity_provider" "this" {
      + accepts_prompt_none_forward_from_client = false
      + add_read_token_role_on_create           = false
      + alias                                   = "azureidir"
      + authenticate_by_default                 = false
      + authorization_url                       = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/azureidir/protocol/openid-connect/auth"
      + backchannel_supported                   = true
      + client_id                               = "**************"
      + client_secret                           = (sensitive value)
      + default_scopes                          = "openid"
      + disable_user_info                       = false
      + display_name                            = "azureidir"
      + enabled                                 = true
      + extra_config                            = {
          + "clientAuthMethod" = "client_secret_post"
        }
      + first_broker_login_flow_alias           = "first broker login"
      + gui_order                               = ""
      + hide_on_login_page                      = false
      + id                                      = (known after apply)
      + internal_id                             = (known after apply)
      + jwks_url                                = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/azureidir/protocol/openid-connect/certs"
      + link_only                               = false
      + login_hint                              = "false"
      + logout_url                              = ""
      + post_broker_login_flow_alias            = ""
      + provider_id                             = "****"
      + realm                                   = (known after apply)
      + store_token                             = false
      + sync_mode                               = "FORCE"
      + token_url                               = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/azureidir/protocol/openid-connect/token"
      + trust_email                             = false
      + ui_locales                              = false
      + user_info_url                           = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/azureidir/protocol/openid-connect/userinfo"
      + validate_signature                      = true
    }

  # module.keycloak_dev.module.standard.module.azureidir_idp_mappers.keycloak_custom_identity_provider_mapper.this["display_name"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "display_name"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "display_name"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "azureidir"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "display_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.azureidir_idp_mappers.keycloak_custom_identity_provider_mapper.this["idir_user_guid"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "idir_user_guid"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "idir_user_guid"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "azureidir"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "idir_user_guid"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.azureidir_idp_mappers.keycloak_custom_identity_provider_mapper.this["idir_username"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "idir_username"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "idir_username"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "azureidir"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "idir_username"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.azureidir_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["display_name"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "display_name"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.azureidir_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["idir_user_guid"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "idir_user_guid"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_user_guid"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "idir_user_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.azureidir_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["idir_username"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "idir_username"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_username"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "idir_username"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.azureidir_scope_mappers.keycloak_openid_client_scope.this will be created
  + resource "keycloak_openid_client_scope" "this" {
      + description            = "azureidir idp client scope"
      + id                     = (known after apply)
      + include_in_token_scope = true
      + name                   = "azureidir"
      + realm_id               = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidbasic_idp.keycloak_oidc_identity_provider.this will be created
  + resource "keycloak_oidc_identity_provider" "this" {
      + accepts_prompt_none_forward_from_client = false
      + add_read_token_role_on_create           = false
      + alias                                   = "bceidbasic"
      + authenticate_by_default                 = false
      + authorization_url                       = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bceidbasic/protocol/openid-connect/auth"
      + backchannel_supported                   = true
      + client_id                               = "**************"
      + client_secret                           = (sensitive value)
      + default_scopes                          = "openid"
      + disable_user_info                       = false
      + display_name                            = "bceidbasic"
      + enabled                                 = true
      + extra_config                            = {
          + "clientAuthMethod" = "client_secret_post"
        }
      + first_broker_login_flow_alias           = "first broker login"
      + gui_order                               = ""
      + hide_on_login_page                      = false
      + id                                      = (known after apply)
      + internal_id                             = (known after apply)
      + jwks_url                                = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bceidbasic/protocol/openid-connect/certs"
      + link_only                               = false
      + login_hint                              = "false"
      + logout_url                              = ""
      + post_broker_login_flow_alias            = ""
      + provider_id                             = "****"
      + realm                                   = (known after apply)
      + store_token                             = false
      + sync_mode                               = "FORCE"
      + token_url                               = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bceidbasic/protocol/openid-connect/token"
      + trust_email                             = false
      + ui_locales                              = false
      + user_info_url                           = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bceidbasic/protocol/openid-connect/userinfo"
      + validate_signature                      = true
    }

  # module.keycloak_dev.module.standard.module.bceidbasic_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_user_guid"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "bceid_user_guid"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_user_guid"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidbasic"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "bceid_user_guid"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidbasic_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_username"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "bceid_username"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_username"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidbasic"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "bceid_username"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidbasic_idp_mappers.keycloak_custom_identity_provider_mapper.this["display_name"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "display_name"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "display_name"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidbasic"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "display_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidbasic_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["bceid_user_guid"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "bceid_user_guid"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_user_guid"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "bceid_user_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidbasic_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["bceid_username"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "bceid_username"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_username"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "bceid_username"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidbasic_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["display_name"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "display_name"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidbasic_scope_mappers.keycloak_openid_client_scope.this will be created
  + resource "keycloak_openid_client_scope" "this" {
      + description            = "bceidbasic idp client scope"
      + id                     = (known after apply)
      + include_in_token_scope = true
      + name                   = "bceidbasic"
      + realm_id               = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidboth_idp.keycloak_oidc_identity_provider.this will be created
  + resource "keycloak_oidc_identity_provider" "this" {
      + accepts_prompt_none_forward_from_client = false
      + add_read_token_role_on_create           = false
      + alias                                   = "bceidboth"
      + authenticate_by_default                 = false
      + authorization_url                       = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bceidboth/protocol/openid-connect/auth"
      + backchannel_supported                   = true
      + client_id                               = "**************"
      + client_secret                           = (sensitive value)
      + default_scopes                          = "openid"
      + disable_user_info                       = false
      + display_name                            = "bceidboth"
      + enabled                                 = true
      + extra_config                            = {
          + "clientAuthMethod" = "client_secret_post"
        }
      + first_broker_login_flow_alias           = "first broker login"
      + gui_order                               = ""
      + hide_on_login_page                      = false
      + id                                      = (known after apply)
      + internal_id                             = (known after apply)
      + jwks_url                                = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bceidboth/protocol/openid-connect/certs"
      + link_only                               = false
      + login_hint                              = "false"
      + logout_url                              = ""
      + post_broker_login_flow_alias            = ""
      + provider_id                             = "****"
      + realm                                   = (known after apply)
      + store_token                             = false
      + sync_mode                               = "FORCE"
      + token_url                               = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bceidboth/protocol/openid-connect/token"
      + trust_email                             = false
      + ui_locales                              = false
      + user_info_url                           = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bceidboth/protocol/openid-connect/userinfo"
      + validate_signature                      = true
    }

  # module.keycloak_dev.module.standard.module.bceidboth_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_business_guid"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "bceid_business_guid"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_business_guid"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidboth"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "bceid_business_guid"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidboth_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_business_name"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "bceid_business_name"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_business_name"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidboth"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "bceid_business_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidboth_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_user_guid"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "bceid_user_guid"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_user_guid"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidboth"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "bceid_user_guid"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidboth_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_username"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "bceid_username"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_username"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidboth"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "bceid_username"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidboth_idp_mappers.keycloak_custom_identity_provider_mapper.this["display_name"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "display_name"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "display_name"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidboth"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "display_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidboth_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["bceid_business_guid"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidboth_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["bceid_business_name"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidboth_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["bceid_user_guid"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "bceid_user_guid"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_user_guid"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "bceid_user_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidboth_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["bceid_username"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "bceid_username"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_username"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "bceid_username"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidboth_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["display_name"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "display_name"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidboth_scope_mappers.keycloak_openid_client_scope.this will be created
  + resource "keycloak_openid_client_scope" "this" {
      + description            = "bceidboth idp client scope"
      + id                     = (known after apply)
      + include_in_token_scope = true
      + name                   = "bceidboth"
      + realm_id               = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidbusiness_idp.keycloak_oidc_identity_provider.this will be created
  + resource "keycloak_oidc_identity_provider" "this" {
      + accepts_prompt_none_forward_from_client = false
      + add_read_token_role_on_create           = false
      + alias                                   = "bceidbusiness"
      + authenticate_by_default                 = false
      + authorization_url                       = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bceidbusiness/protocol/openid-connect/auth"
      + backchannel_supported                   = true
      + client_id                               = "**************"
      + client_secret                           = (sensitive value)
      + default_scopes                          = "openid"
      + disable_user_info                       = false
      + display_name                            = "bceidbusiness"
      + enabled                                 = true
      + extra_config                            = {
          + "clientAuthMethod" = "client_secret_post"
        }
      + first_broker_login_flow_alias           = "first broker login"
      + gui_order                               = ""
      + hide_on_login_page                      = false
      + id                                      = (known after apply)
      + internal_id                             = (known after apply)
      + jwks_url                                = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bceidbusiness/protocol/openid-connect/certs"
      + link_only                               = false
      + login_hint                              = "false"
      + logout_url                              = ""
      + post_broker_login_flow_alias            = ""
      + provider_id                             = "****"
      + realm                                   = (known after apply)
      + store_token                             = false
      + sync_mode                               = "FORCE"
      + token_url                               = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bceidbusiness/protocol/openid-connect/token"
      + trust_email                             = false
      + ui_locales                              = false
      + user_info_url                           = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bceidbusiness/protocol/openid-connect/userinfo"
      + validate_signature                      = true
    }

  # module.keycloak_dev.module.standard.module.bceidbusiness_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_business_guid"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "bceid_business_guid"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_business_guid"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidbusiness"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "bceid_business_guid"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidbusiness_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_business_name"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "bceid_business_name"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_business_name"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidbusiness"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "bceid_business_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidbusiness_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_user_guid"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "bceid_user_guid"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_user_guid"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidbusiness"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "bceid_user_guid"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidbusiness_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_username"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "bceid_username"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_username"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidbusiness"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "bceid_username"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidbusiness_idp_mappers.keycloak_custom_identity_provider_mapper.this["display_name"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "display_name"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "display_name"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidbusiness"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "display_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidbusiness_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["bceid_business_guid"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidbusiness_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["bceid_business_name"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidbusiness_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["bceid_user_guid"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "bceid_user_guid"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_user_guid"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "bceid_user_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidbusiness_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["bceid_username"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "bceid_username"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_username"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "bceid_username"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidbusiness_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["display_name"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "display_name"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bceidbusiness_scope_mappers.keycloak_openid_client_scope.this will be created
  + resource "keycloak_openid_client_scope" "this" {
      + description            = "bceidbusiness idp client scope"
      + id                     = (known after apply)
      + include_in_token_scope = true
      + name                   = "bceidbusiness"
      + realm_id               = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp.keycloak_oidc_identity_provider.this will be created
  + resource "keycloak_oidc_identity_provider" "this" {
      + accepts_prompt_none_forward_from_client = false
      + add_read_token_role_on_create           = false
      + alias                                   = "bcsc"
      + authenticate_by_default                 = false
      + authorization_url                       = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bcsc/protocol/openid-connect/auth"
      + backchannel_supported                   = true
      + client_id                               = "**************"
      + client_secret                           = (sensitive value)
      + default_scopes                          = "openid"
      + disable_user_info                       = false
      + display_name                            = "bcsc"
      + enabled                                 = true
      + extra_config                            = {
          + "clientAuthMethod" = "client_secret_post"
        }
      + first_broker_login_flow_alias           = "first broker login"
      + gui_order                               = ""
      + hide_on_login_page                      = false
      + id                                      = (known after apply)
      + internal_id                             = (known after apply)
      + jwks_url                                = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bcsc/protocol/openid-connect/certs"
      + link_only                               = false
      + login_hint                              = "false"
      + logout_url                              = ""
      + post_broker_login_flow_alias            = ""
      + provider_id                             = "****"
      + realm                                   = (known after apply)
      + store_token                             = false
      + sync_mode                               = "FORCE"
      + token_url                               = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bcsc/protocol/openid-connect/token"
      + trust_email                             = false
      + ui_locales                              = false
      + user_info_url                           = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bcsc/protocol/openid-connect/userinfo"
      + validate_signature                      = true
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_business_guid"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "bceid_business_guid"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_business_guid"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "bceid_business_guid"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_business_name"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "bceid_business_name"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_business_name"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "bceid_business_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_user_guid"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "bceid_user_guid"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_user_guid"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "bceid_user_guid"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_username"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "bceid_username"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_username"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "bceid_username"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["display_name"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "display_name"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "display_name"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "display_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["bceid_business_guid"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["bceid_business_name"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["bceid_user_guid"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "bceid_user_guid"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_user_guid"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "bceid_user_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["bceid_username"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "bceid_username"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_username"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "bceid_username"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["display_name"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "display_name"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_openid_client_scope.this will be created
  + resource "keycloak_openid_client_scope" "this" {
      + description            = "bcsc idp client scope"
      + id                     = (known after apply)
      + include_in_token_scope = true
      + name                   = "bcsc"
      + realm_id               = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.common_scope_mappers.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"         = "****"
          + "access.tokenResponse.claim" = "*****"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "****"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.common_scope_mappers.keycloak_openid_client_scope.this will be created
  + resource "keycloak_openid_client_scope" "this" {
      + description            = "common client scope"
      + id                     = (known after apply)
      + include_in_token_scope = false
      + name                   = "common"
      + realm_id               = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.idir_idp.keycloak_oidc_identity_provider.this will be created
  + resource "keycloak_oidc_identity_provider" "this" {
      + accepts_prompt_none_forward_from_client = false
      + add_read_token_role_on_create           = false
      + alias                                   = "idir"
      + authenticate_by_default                 = false
      + authorization_url                       = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/idir/protocol/openid-connect/auth"
      + backchannel_supported                   = true
      + client_id                               = "**************"
      + client_secret                           = (sensitive value)
      + default_scopes                          = "openid"
      + disable_user_info                       = false
      + display_name                            = "idir"
      + enabled                                 = true
      + extra_config                            = {
          + "clientAuthMethod" = "client_secret_post"
        }
      + first_broker_login_flow_alias           = "first broker login"
      + gui_order                               = ""
      + hide_on_login_page                      = false
      + id                                      = (known after apply)
      + internal_id                             = (known after apply)
      + jwks_url                                = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/idir/protocol/openid-connect/certs"
      + link_only                               = false
      + login_hint                              = "false"
      + logout_url                              = ""
      + post_broker_login_flow_alias            = ""
      + provider_id                             = "****"
      + realm                                   = (known after apply)
      + store_token                             = false
      + sync_mode                               = "FORCE"
      + token_url                               = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/idir/protocol/openid-connect/token"
      + trust_email                             = false
      + ui_locales                              = false
      + user_info_url                           = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/idir/protocol/openid-connect/userinfo"
      + validate_signature                      = true
    }

  # module.keycloak_dev.module.standard.module.idir_idp_mappers.keycloak_custom_identity_provider_mapper.this["display_name"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "display_name"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "display_name"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "idir"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "display_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.idir_idp_mappers.keycloak_custom_identity_provider_mapper.this["idir_user_guid"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "idir_user_guid"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "idir_user_guid"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "idir"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "idir_user_guid"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.idir_idp_mappers.keycloak_custom_identity_provider_mapper.this["idir_username"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "idir_username"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "idir_username"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "idir"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "idir_username"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.idir_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["display_name"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "display_name"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.idir_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["idir_user_guid"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "idir_user_guid"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_user_guid"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "idir_user_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.idir_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["idir_username"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "idir_username"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_username"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "idir_username"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.idir_scope_mappers.keycloak_openid_client_scope.this will be created
  + resource "keycloak_openid_client_scope" "this" {
      + description            = "idir idp client scope"
      + id                     = (known after apply)
      + include_in_token_scope = true
      + name                   = "idir"
      + realm_id               = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.idp_auth_flow.keycloak_authentication_execution.exec1 will be created
  + resource "keycloak_authentication_execution" "exec1" {
      + authenticator     = "cookie-stopper"
      + id                = (known after apply)
      + parent_flow_alias = "idp stopper"
      + realm_id          = (known after apply)
      + requirement       = "ALTERNATIVE"
    }

  # module.keycloak_dev.module.standard.module.idp_auth_flow.keycloak_authentication_execution.exec2 will be created
  + resource "keycloak_authentication_execution" "exec2" {
      + authenticator     = "identity-provider-stopper"
      + id                = (known after apply)
      + parent_flow_alias = "idp stopper"
      + realm_id          = (known after apply)
      + requirement       = "ALTERNATIVE"
    }

  # module.keycloak_dev.module.standard.module.idp_auth_flow.keycloak_authentication_execution.exec3 will be created
  + resource "keycloak_authentication_execution" "exec3" {
      + authenticator     = "identity-provider-stop-form"
      + id                = (known after apply)
      + parent_flow_alias = "idp stopper"
      + realm_id          = (known after apply)
      + requirement       = "ALTERNATIVE"
    }

  # module.keycloak_dev.module.standard.module.idp_auth_flow.keycloak_authentication_flow.this will be created
  + resource "keycloak_authentication_flow" "this" {
      + alias       = "idp stopper"
      + id          = (known after apply)
      + provider_id = "**********"
      + realm_id    = (known after apply)
    }

  # module.keycloak_dev.module.standard.module.realm.keycloak_realm.this will be created
  + resource "keycloak_realm" "this" {
      + access_code_lifespan                     = "1m"
      + access_code_lifespan_login               = "30m"
      + access_code_lifespan_user_action         = "5m"
      + access_token_lifespan                    = "**"
      + access_token_lifespan_for_implicit_flow  = "***"
      + action_token_generated_by_admin_lifespan = "***"
      + action_token_generated_by_user_lifespan  = "**"
      + browser_flow                             = (known after apply)
      + client_authentication_flow               = (known after apply)
      + client_session_idle_timeout              = (known after apply)
      + client_session_max_lifespan              = (known after apply)
      + direct_grant_flow                        = (known after apply)
      + display_name                             = "standard"
      + display_name_html                        = "<b>standard</b>"
      + docker_authentication_flow               = (known after apply)
      + duplicate_emails_allowed                 = true
      + edit_username_allowed                    = (known after apply)
      + enabled                                  = true
      + id                                       = (known after apply)
      + internal_id                              = (known after apply)
      + login_theme                              = "bcgov-idp-stopper"
      + login_with_email_allowed                 = false
      + oauth2_device_code_lifespan              = (known after apply)
      + oauth2_device_polling_interval           = (known after apply)
      + offline_session_idle_timeout             = "****"
      + offline_session_max_lifespan             = (known after apply)
      + offline_session_max_lifespan_enabled     = false
      + realm                                    = "standard"
      + refresh_token_max_reuse                  = 0
      + registration_allowed                     = (known after apply)
      + registration_email_as_username           = (known after apply)
      + registration_flow                        = (known after apply)
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = true
      + ssl_required                             = "external"
      + sso_session_idle_timeout                 = "***"
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = "10h"
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = false
      + verify_email                             = (known after apply)

      + otp_policy {
          + algorithm         = (known after apply)
          + digits            = (known after apply)
          + initial_counter   = (known after apply)
          + look_ahead_window = (known after apply)
          + period            = (known after apply)
          + type              = (known after apply)
        }

      + web_authn_passwordless_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }

      + web_authn_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }
    }

  # module.keycloak_dev.module.standard_clients.module.demo-testing-5-16-3644.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "****"
          + "id.token.claim"           = "*****"
          + "included.client.audience" = "demo-testing-5-16-3644"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard_clients.module.demo-testing-5-16-3644.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "****"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "****"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "****"
          + "usermodel.clientRoleMapping.clientId" = "demo-testing-5-16-3644"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.standard_clients.module.demo-testing-5-16-3644.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                               = "PUBLIC"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "**********************"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "CSS App"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "demo-testing-5-16-3644"
      + oauth2_device_authorization_grant_enabled = false
      + pkce_code_challenge_method                = "S256"
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "http://localhost:3000*",
        ]
      + web_origins                               = [
          + "+",
          + "http://localhost:3000*",
        ]

      + authentication_flow_binding_overrides {
          + browser_id = (known after apply)
        }
    }

  # module.keycloak_dev.module.standard_clients.module.demo-testing-5-16-3644.keycloak_openid_client_default_scopes.idp_scopes will be created
  + resource "keycloak_openid_client_default_scopes" "idp_scopes" {
      + client_id      = (known after apply)
      + default_scopes = [
          + "bceidbasic",
          + "bceidboth",
          + "bceidbusiness",
          + "bcsc",
          + "common",
          + "email",
          + "idir",
          + "profile",
        ]
      + id             = (known after apply)
      + realm_id       = (known after apply)
    }

  # module.keycloak_dev.module.standard_clients.module.demo-testing-5-16-3644.keycloak_openid_client_optional_scopes.client_optional_scopes will be created
  + resource "keycloak_openid_client_optional_scopes" "client_optional_scopes" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + optional_scopes = [
          + "offline_access",
        ]
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.azureidir.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["display_name"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "display_name"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.azureidir.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["idir_user_guid"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "idir_user_guid"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_user_guid"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "idir_user_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.azureidir.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["idir_username"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "idir_username"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_username"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "idir_username"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.bceidbasic.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["bceid_user_guid"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "bceid_user_guid"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_user_guid"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "bceid_user_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.bceidbasic.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["bceid_username"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "bceid_username"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_username"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "bceid_username"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.bceidbasic.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["display_name"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "display_name"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.bceidboth.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["bceid_business_guid"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.bceidboth.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["bceid_business_name"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.bceidboth.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["bceid_user_guid"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "bceid_user_guid"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_user_guid"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "bceid_user_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.bceidboth.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["bceid_username"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "bceid_username"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_username"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "bceid_username"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.bceidboth.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["display_name"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "display_name"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.bceidbusiness.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["bceid_business_guid"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.bceidbusiness.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["bceid_business_name"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.bceidbusiness.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["bceid_user_guid"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "bceid_user_guid"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_user_guid"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "bceid_user_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.bceidbusiness.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["bceid_username"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "bceid_username"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_username"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "bceid_username"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.bceidbusiness.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["display_name"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "display_name"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["display_name"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "display_name"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["idir_user_guid"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "idir_user_guid"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_user_guid"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "idir_user_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["idir_username"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "idir_username"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_username"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "idir_username"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.idir.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["display_name"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "display_name"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.idir.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["idir_user_guid"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "idir_user_guid"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_user_guid"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "idir_user_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.idir.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["idir_username"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "idir_username"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_username"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "idir_username"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_idir_link.module.idp_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["display_name"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "display_name"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_idir_link.module.idp_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["idir_user_guid"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "idir_user_guid"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_user_guid"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "idir_user_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_idir_link.module.idp_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["idir_username"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "idir_username"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_username"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "idir_username"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = (known after apply)
    }

Plan: 191 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Runs KeyCloak terraform plan #8](https://github.com/bcgov/social-access-portal/actions/runs/2416937447)